app/views/messages/index.html.erb

        <td><%= message.chat_id %></td>
        <td><%= message.user.first_name %> <%= message.user.last_name %></td>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 10 LIMIT 1