app/views/messages/new.html.erb

  <%= form.label :chat_id %>
  <%= form.select :chat_id, Chat.all.collect { |c| ["Chat ##{c.id}", c.id] } %><br>
---
SELECT "chats".* FROM "chats"

  <%= form.label :user_id, "Author" %>
  <%= form.select :user_id, User.all.collect { |u| ["#{u.first_name} #{u.last_name}", u.id] } %><br>
---
SELECT "users".* FROM "users"