app/views/messages/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
<p>
  <strong>Author:</strong> <%= @message.user.first_name %> <%= @message.user.last_name %>

SELECT "chats".* FROM "chats" WHERE "chats"."id" = 1 LIMIT 1
---
  <strong>Chat between:</strong>
  <%= @message.chat.sender.first_name %> <%= @message.chat.sender.last_name %>