app/views/users/index.html.erb

        <td><%= user.last_name %></td>
        <td><%= user.messages.count %></td>
---
SELECT COUNT(*) FROM "messages" WHERE "messages"."user_id" = 4