app/views/users/show.html.erb

SELECT "chats".* FROM "chats" WHERE ("chats"."sender_id" = 1 OR "chats"."receiver_id" = 1)
---
<ul>
  <% Chat.where(sender: @user).or(Chat.where(receiver: @user)).each do |chat| %>

SELECT "messages".* FROM "messages" WHERE "messages"."user_id" = 1
---
<ul>
  <% @user.messages.each do |msg| %>