app/views/chats/new.html.erb

  <%= form.label :sender_id, "Sender" %>
  <%= form.select :sender_id, User.all.collect { |u| [u.first_name, u.id] } %><br>
---
SELECT "users".* FROM "users"

  <%= form.label :receiver_id, "Receiver" %>
  <%= form.select :receiver_id, User.all.collect { |u| [u.first_name, u.id] } %><br>
---
SELECT "users".* FROM "users"