app/views/chats/show.html.erb

<ul>
  <% @chat.messages.each do |msg| %>
    <li>
      <strong><%= msg.user.first_name %>:</strong> <%= msg.body %> —
---
SELECT "messages".* FROM "messages" WHERE "messages"."chat_id" = 1
SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1