app/controllers/chats_controller.rb

SELECT "chats".* FROM "chats" WHERE (sender_id = 16 OR receiver_id = 16)
---
  def index
    @chats = Chat.all

SELECT "chats".* FROM "chats" WHERE "chats"."id" = 11 LIMIT 1
---
  def show
    @chat = Chat.find(params[:id])

INSERT INTO "chats" ("sender_id", "receiver_id", "created_at", "updated_at") VALUES (11, 12, '2025-05-01 03:06:55.760104', '2025-05-01 03:06:55.760104') RETURNING "id"
---
  def create
    @chat = Chat.new(chat_params)
    if @chat.save

SELECT "chats".* FROM "chats" WHERE "chats"."id" = 1 LIMIT 1
---
  def edit
    @chat = Chat.find(params[:id])

SELECT "chats".* FROM "chats" WHERE "chats"."id" = 1 LIMIT 1
---
  def update
    @chat = Chat.find(params[:id])