app/controllers/chats_controller.rb

DELETE FROM "chats" WHERE "chats"."id" = 19
---
  def destroy
    @chat.destroy