app/controllers/messages_controller.rb

  def create
    @message = Message.new(message_params)
    if @message.save
---
INSERT INTO "messages" ("chat_id", "user_id", "body", "created_at", "updated_at") VALUES (1, 1, 'd', '2025-05-01 03:08:59.002283', '2025-05-01 03:08:59.002283') RETURNING "id"

  def edit
    @message = Message.find(params[:id])
---
SELECT "messages".* FROM "messages" WHERE "messages"."id" = 1 LIMIT 1

  def update
    @message = Message.find(params[:id])
    if @message.update(message_params)
---
SELECT "messages".* FROM "messages" WHERE "messages"."id" = 1 LIMIT 1
UPDATE "messages" SET "body" = 'This is a test edmessage', "updated_at" = '2025-05-16 22:09:45.750529' WHERE "messages"."id" = 1