app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("email", "first_name", "last_name", "created_at", "updated_at") VALUES ('josefadarrouy@gmail.com', 'josefa', 'darrouy', '2025-05-01 03:01:42.394634', '2025-05-01 03:01:42.394634') RETURNING "id"

  def update
    @user = User.find(params[:id])
    if @user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
UPDATE "users" SET "first_name" = 'First0d', "updated_at" = '2025-05-16 22:04:26.042785' WHERE "users"."id" = 1